# Study Summary

1. 知道 DataFrame 中迴圈的運作規則
2. 了解 DataFrame 中 Map、 Apply、Applymap 差異
3. 知道不建議在 DataFrame 進行迭代操作的原因

In [37]:
import pandas as pd

### 1. DataFrame 當中的 For Loop

In [3]:
df = pd.DataFrame({
  'name': ['Alice', 'Bob'],
  'age': [20, 32]
})

for c in df:
  print(c)

name
age

### 2.橫向的資料迭代_以「筆」為單位的資料迭代

#### 方法一: 用for loop(暴力法)

In [23]:
df = pd.DataFrame({
  'name': ['Alice', 'Bob'],
  'age': [20, 32]
})

for i in range(len(df)):  #len函數用於返回字串、列表、字典、元組等長度
    print(df.iloc[i])

name    Alice
age        20
Name: 0, dtype: object
name    Bob
age      32
Name: 1, dtype: object

#### 方法二: 用iteritems、iterrows、itertuples

In [35]:
for d in df.iteritems():
  print(d)

('name', 0    Alice
1      Bob
Name: name, dtype: object)
('age', 0    20
1    32
Name: age, dtype: int64)

In [36]:
for d in df.iterrows():
  print(d)

(0, name    Alice
age        20
Name: 0, dtype: object)
(1, name    Bob
age      32
Name: 1, dtype: object)

In [37]:
for d in df.itertuples():
  print(d)

Pandas(Index=0, name='Alice', age=20)
Pandas(Index=1, name='Bob', age=32)

#### 方法三: 用apply_逐行或逐列的循環處理方法

In [64]:
import numpy as np

In [86]:
df = pd.DataFrame({
  'food': ['Toro', 'salmon', 'Shrimp'],
  'price': [1000, 520, 600]
})

In [77]:
result1 = df.apply(np.max)
result1

food     salmon
price      1000
dtype: object

In [79]:
result2= df.apply(np.min)
result2

food     Shrimp
price       520
dtype: object

####方法三: apply 搭配 lambda

In [88]:
#ref: https://sparkbyexamples.com/pandas/pandas-apply-with-lambda-examples/
data = [(3,5,7), (2,4,6),(5,8,9)] 
df1 = pd.DataFrame(data, columns = ['A','B','C'])
df1["A"].apply(lambda x: x-2) #指定計算哪個欄位

0    1
1    0
2    3
Name: A, dtype: int64

####跟apply類似的涵式-map

In [91]:
df = pd.DataFrame({
    'score':[10,20,30],
    'age':[60,70,80]
})

In [92]:
df['age'].map(lambda x: -x) #對 series 所有元素作一樣的操作

0   -60
1   -70
2   -80
Name: age, dtype: int64

In [95]:
df.applymap(lambda x: -x) #對 dataframe 所有元素作一樣的操作

   score  age
0    -10  -60
1    -20  -70
2    -30  -80

In [99]:
df.apply(lambda x:-x) #對 series 或 dataframe 逐行或逐列做一樣的操作

   score  age
0    -10  -60
1    -20  -70
2    -30  -80

In [100]:
df['age'].apply(lambda x:-x)

0   -60
1   -70
2   -80
Name: age, dtype: int64

# Homework
1. 根據給定的 DataFrame 中取出索引為4, 5 的 animal 和 age 欄位。
2. 請將 dataFrame 所有字串都變成是大寫開頭。

#### 1. 根據給定的 DataFrame 中取出索引為 4, 5 的 animal 和 age 欄位。

In [2]:
import numpy as np
import pandas as pd

In [32]:
data = {'animal':['cat', 'dog', 'fish', 'turtle', 'rabbit'],
        'age':[1,2,3,4,5],
        'visits':[5,10,15,20,22],
        'gender':['male','female','female', np.nan, np.nan]}
index = ['a','b','c','d','e']

data = pd.DataFrame(data, index = index)
data

   animal  age  visits  gender
a     cat    1       5    male
b     dog    2      10  female
c    fish    3      15  female
d  turtle    4      20     NaN
e  rabbit    5      22     NaN

In [33]:
data.loc[data.index[[3,4]],['animal','age']] #取行3,4，列animal,age資料

   animal  age
d  turtle    4
e  rabbit    5

In [31]:
#ref:http://www.tshopping.com.tw/thread-263687-1-1.html #iloc, loc取行列用法
data.loc[[4,5],['animal','age']]

   animal  age
4  turtle    4
5  rabbit    5

In [15]:
data.loc[3:4]

   animal  age  visits  gender
3    fish    3      15  female
4  turtle    4      20     NaN

#### 2. 請將 dataFrame 所有字串都變成是大寫開頭

In [34]:
data = pd.DataFrame([
    ['tom', 'mark', 'mary'],
    ['bob', 'alice', 'john']
])
data

     0      1     2
0  tom   mark  mary
1  bob  alice  john

In [39]:
data.applymap(lambda x:x.title())

     0      1     2
0  Tom   Mark  Mary
1  Bob  Alice  John